  # Challenge

  ## Identifying Outliers using Standard Deviation

In [1]:
# initial imports
import os
from dotenv import load_dotenv
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [4]:
# create a connection to the database
load_dotenv()
pg_pw = os.getenv("pg_pw")
print(type(pg_pw))

engine = create_engine(f"postgresql://postgres:{pg_pw}@localhost:5432/fraud_detection")

#Get transaction info, as well as customer and merchant
qry = """
    SELECT t.transaction_id, t.transaction_date, t.amount, ca.card_id, cu.customer_id, cu.full_name, t.merchant_id
    FROM \"transaction\" as t
    JOIN credit_card as ca ON ca.card_id = t.card_id
    JOIN card_holder as cu ON ca.customer_id = cu.customer_id;

"""

df = pd.read_sql(qry, engine)

<class 'str'>

In [5]:
# code a function to identify outliers based on standard deviation

# #To get the mean
def get_mean(df):
    df_mean = df["amount"].mean()
    return df_mean

 #To get the st dev
def get_std(df):
    df_std = df["amount"].std()
    
    return df_std

# To get outliers above the st dev, with an option to change sensitivity in terms of st devs, 1 is default
# Note - only checks in 1 direction since std > mean, and values must be positive

def get_outliers(df, num_std = 1):
    df_ol = df[df["amount"] > get_mean(df) + (get_std(df)*num_std)]
    return df_ol

# #Test
# #m = get_mean(df) -> 40.79
# #s = get_std(df)# -> 202.04
#for 1 st dev, all transactions should exceed $243, for 2 st dev, $445

                                              
df_ol = get_outliers(df,2)
df_ol.head(10)

,transaction_id,transaction_date,amount,card_id,customer_id,full_name,merchant_id
15,99,2018-01-02 23:27:46,1031.0,501879657465,12,Megan Price,95
27,2650,2018-01-04 03:05:18,1685.0,3516952396080247,7,Sean Taylor,80
62,1291,2018-01-08 02:34:32,1029.0,3581345943543942,6,Beth Hernandez,145
212,1442,2018-01-22 08:07:03,1131.0,5570600642865857,16,Crystal Clark,144
219,2667,2018-01-23 06:29:37,1678.0,501879657465,12,Megan Price,92
235,2913,2018-01-24 13:17:19,1691.0,4761049645711555811,1,Robert Johnson,14
296,1415,2018-01-30 18:31:00,1177.0,4319653513507,25,Nancy Contreras,64
379,2409,2018-02-09 11:38:37,445.0,3516952396080247,7,Sean Taylor,112
457,2699,2018-02-17 01:27:19,1430.0,5570600642865857,16,Crystal Clark,71
484,1480,2018-02-19 16:00:43,1072.0,3516952396080247,7,Sean Taylor,49

In [7]:
# find anomalous transactions for 3 random card holders

#Get 3 random customer Id's, conditionals added to remove dupes since list is fairly small
match = True

rand_id1 = np.random.randint(1,25)

while match:
    rand_id2 = np.random.randint(1,25)
    if rand_id2 != rand_id1:
        match = False
match = True

while match:
    rand_id3 = np.random.randint(1,25)
    if rand_id3 != rand_id1 | rand_id2:
        match = False
    

print(rand_id1,rand_id2,rand_id3)
df_trans = {} #initialize dictionary that will combine transactions of all 3 random customers


df_trans = df[df["customer_id"].isin([rand_id1,rand_id2,rand_id3])]
df_trans


#Merge/Join against outliers generated above.  Any resultant transaction will be included in both lists
df_anom = df_trans.merge(df_ol,how = "inner", on = "transaction_id" )
df_anom
#df_trans2

17 14 3

,transaction_id,transaction_date_x,amount_x,card_id_x,customer_id_x,full_name_x,merchant_id_x,transaction_date_y,amount_y,card_id_y,customer_id_y,full_name_y,merchant_id_y
0,1005,2018-03-01 21:29:05,1119.0,30078299053512,3,Elizabeth Sawyer,19,2018-03-01 21:29:05,1119.0,30078299053512,3,Elizabeth Sawyer,19
1,1334,2018-07-11 16:55:22,1159.0,30078299053512,3,Elizabeth Sawyer,107,2018-07-11 16:55:22,1159.0,30078299053512,3,Elizabeth Sawyer,107
2,1349,2018-07-14 06:09:18,1160.0,30078299053512,3,Elizabeth Sawyer,136,2018-07-14 06:09:18,1160.0,30078299053512,3,Elizabeth Sawyer,136
3,16,2018-09-09 03:39:06,626.0,30078299053512,3,Elizabeth Sawyer,135,2018-09-09 03:39:06,626.0,30078299053512,3,Elizabeth Sawyer,135
4,384,2018-10-07 14:40:34,757.0,30078299053512,3,Elizabeth Sawyer,73,2018-10-07 14:40:34,757.0,30078299053512,3,Elizabeth Sawyer,73
5,1549,2018-10-19 01:07:37,1053.0,30078299053512,3,Elizabeth Sawyer,10,2018-10-19 01:07:37,1053.0,30078299053512,3,Elizabeth Sawyer,10
6,1629,2018-11-20 05:24:28,1054.0,30078299053512,3,Elizabeth Sawyer,22,2018-11-20 05:24:28,1054.0,30078299053512,3,Elizabeth Sawyer,22

  ## Identifying Outliers Using Interquartile Range

In [20]:
# code a function to identify outliers based on interquartile range
'''
Not sure if this is quite right.  I set up the quartiles, then queried the upper and lower bounds
'''

q1 = df["amount"].quantile(0.25)
#q2 = df["amount"].quantile(0.50)
q3 = df["amount"].quantile(0.75)

iqr = q3 - q1
iqr_lb = iqr - (1.5 * iqr) #lower bound
iqr_ub = iqr + (1.5 * iqr) #upper bound

#very low transaction amounts, lower bound could be negative
if iqr_lb < 0:
    iqr_lb = 0

df_iqr = df.query(f'@iqr_lb <= amount <= @iqr_ub')

,transaction_id,transaction_date,amount,card_id,customer_id,full_name,merchant_id
3495,1979,2018-12-31 01:24:15,4.84,4723783028106084756,15,Kyle Tucker,106
3496,2342,2018-12-31 03:33:28,3.26,4165305432349489280,10,Matthew Gutierrez,64
3497,948,2018-12-31 05:53:58,10.73,5361779664174555,19,Peter Mckay,19
3498,1168,2018-12-31 08:22:17,11.87,4188164051171486,23,Mark Lewis,54
3499,2476,2018-12-31 09:50:25,19.75,4723783028106084756,15,Kyle Tucker,16

In [21]:
# find anomalous transactions for 3 random card holders
match = True

rand_id1 = np.random.randint(1,25)

while match:
    rand_id2 = np.random.randint(1,25)
    if rand_id2 != rand_id1:
        match = False
match = True

while match:
    rand_id3 == np.random.randint(1,25)
    if rand_id3 != rand_id1 | rand_id2:
        match = False
    
df_trans_iqr = df[df["customer_id"].isin([rand_id1,rand_id2,rand_id3])]

#Merge/Join against outliers generated above. Will need to filter by NaNs to get those NOT in the middle 50%, to indicate they are outliers
df_trans_iqr = df_trans.merge(df_iqr,how = "left", on = "transaction_id" )

#Perhaps not the best way, but seems to work.  Returns those transactions from 3 customers where transactions are not in the middle 50%
is_nan = df_trans_iqr.isnull()
row_nan = is_nan.any(axis=1)
df_iqr_filtered = df_trans_iqr[row_nan]
df_iqr_filtered

,transaction_id,transaction_date_x,amount_x,card_id_x,customer_id_x,full_name_x,merchant_id_x,transaction_date_y,amount_y,card_id_y,customer_id_y,full_name_y,merchant_id_y
19,1005,2018-03-01 21:29:05,1119.0,30078299053512,3,Elizabeth Sawyer,19,NaT,NaN,NaN,NaN,NaN,NaN
94,1334,2018-07-11 16:55:22,1159.0,30078299053512,3,Elizabeth Sawyer,107,NaT,NaN,NaN,NaN,NaN,NaN
96,1349,2018-07-14 06:09:18,1160.0,30078299053512,3,Elizabeth Sawyer,136,NaT,NaN,NaN,NaN,NaN,NaN
112,2121,2018-08-21 20:46:33,188.0,30078299053512,3,Elizabeth Sawyer,71,NaT,NaN,NaN,NaN,NaN,NaN
116,16,2018-09-09 03:39:06,626.0,30078299053512,3,Elizabeth Sawyer,135,NaT,NaN,NaN,NaN,NaN,NaN
137,384,2018-10-07 14:40:34,757.0,30078299053512,3,Elizabeth Sawyer,73,NaT,NaN,NaN,NaN,NaN,NaN
139,696,2018-10-11 23:29:33,206.0,30078299053512,3,Elizabeth Sawyer,144,NaT,NaN,NaN,NaN,NaN,NaN
147,1549,2018-10-19 01:07:37,1053.0,30078299053512,3,Elizabeth Sawyer,10,NaT,NaN,NaN,NaN,NaN,NaN
161,1629,2018-11-20 05:24:28,1054.0,30078299053512,3,Elizabeth Sawyer,22,NaT,NaN,NaN,NaN,NaN,NaN
180,2164,2018-12-28 16:20:31,313.0,30078299053512,3,Elizabeth Sawyer,12,NaT,NaN,NaN,NaN,NaN,NaN